# Pandas DataFrame Operations
This notebook demonstrates how to create and manipulate a **Pandas DataFrame** in Python.  

Users can:
1. Create a DataFrame from a dictionary  
2. Access specific columns, rows, and sub-sections using `iloc` and `loc`  
3. Slice rows and columns  
4. Retrieve multiple columns at once  
5. Delete a column using `drop()`  
6. Modify column values  
7. Rename columns  
8. Select specific rows and columns using indexing  

This project demonstrates the use of **Pandas for data manipulation and analysis**, which is a core skill for **data analysts and data scientists**.

In [2]:
import pandas as pd
dict={'Name':['John', 'Alice', 'Bob', 'Eve'], 'Age':[25,30,22,35], 'Gender':['Male', 'Female', 'Male', 'Female'], 'Salary':[50000,55000,40000,70000]}
df=pd.DataFrame(dict)
print(df)

#Accessing the column
print("Second column:")
print(df['Age'])
#Accessing rows by index print("Second row:")
print(df.iloc[1])
#Accessing multiple rows and columns
print("First three rows and first two columns:")
print(df.loc[0:2, ['Name', 'Age']])

#Slicing using iloc #Slicing rows
print("First 4 rows:")
print(df.iloc[0:4])
#Slicing columns
print("All two rows and first two columns")
print(df.iloc[:,0:2])
print("Value at 3rd row and 4th column is")
print(df.iloc[2,3])

#To retrieve columns
print(df[['Name', 'Age']])

#To delete column
df.drop("Age", axis=1, inplace=True)
print(df)

#Modifying the column
df['Salary']=df['Salary']+5000
print(df)

#Renaming a column
df.rename(columns={'Salary':'Sal'}, inplace=True)
print(df)

#Selecting specific columns
df_with_index=df.set_index('Name')
selection=df_with_index.loc[['John', 'Bob'], ['Gender', 'Sal']]
print("After selecting specific columns:")
print(selection)

    Name  Age  Gender  Salary
0   John   25    Male   50000
1  Alice   30  Female   55000
2    Bob   22    Male   40000
3    Eve   35  Female   70000
Second column:
0    25
1    30
2    22
3    35
Name: Age, dtype: int64
Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object
First three rows and first two columns:
    Name  Age
0   John   25
1  Alice   30
2    Bob   22
First 4 rows:
    Name  Age  Gender  Salary
0   John   25    Male   50000
1  Alice   30  Female   55000
2    Bob   22    Male   40000
3    Eve   35  Female   70000
All two rows and first two columns
    Name  Age
0   John   25
1  Alice   30
2    Bob   22
3    Eve   35
Value at 3rd row and 4th column is
40000
    Name  Age
0   John   25
1  Alice   30
2    Bob   22
3    Eve   35
    Name  Gender  Salary
0   John    Male   50000
1  Alice  Female   55000
2    Bob    Male   40000
3    Eve  Female   70000
    Name  Gender  Salary
0   John    Male   55000
1  Alice  Female   60000
2    Bob    Male   45000
3    Eve  Female   75000
    Name  Gender    Sal
0   John    Male  55000
1  Alice  Female  60000
2    Bob    Male  45000
3    Eve  Female  75000
After selecting specific columns:
     Gender    Sal
Name
John   Male  55000
Bob    Male  45000